In [1]:
import numpy as np
import pandas as pd

Series : A one-dimensional labeled array holding data of any type
DataFrame: A two-dimensional data structure that holds data like a two-dimension array or a table with rows and columns

In [2]:
s= pd.Series([1,3,5,np.nan,6,9])

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list("ABCD"))

In [5]:
df

                   A         B         C         D
2013-01-01 -0.436202  0.057075  0.454982 -0.676161
2013-01-02 -1.291354  2.233037 -0.172543 -0.418074
2013-01-03 -0.444391  0.667790 -0.713753  1.252802
2013-01-04 -1.286181  0.196010  0.651584 -1.081878
2013-01-05  0.424460  0.462068  0.141389  0.298197
2013-01-06  1.162147  0.654685  0.333264  0.971378

In [6]:
df2 = pd.DataFrame(
    {
        "A":5.00,
        "B":pd.Timestamp("20130102"), 
        "C":pd.Series(1,index=list(range(4)), dtype = "float32"),
        "D":np.array([3]*4, dtype="int32"),
        "E":pd.Categorical(["test","train","test","train"]),
        "F":"Hi"
    }
)
df2

     A          B    C  D      E   F
0  5.0 2013-01-02  1.0  3   test  Hi
1  5.0 2013-01-02  1.0  3  train  Hi
2  5.0 2013-01-02  1.0  3   test  Hi
3  5.0 2013-01-02  1.0  3  train  Hi

In [7]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [8]:
df2.head()

     A          B    C  D      E   F
0  5.0 2013-01-02  1.0  3   test  Hi
1  5.0 2013-01-02  1.0  3  train  Hi
2  5.0 2013-01-02  1.0  3   test  Hi
3  5.0 2013-01-02  1.0  3  train  Hi

In [9]:
df.tail(2)

                   A         B         C         D
2013-01-05  0.424460  0.462068  0.141389  0.298197
2013-01-06  1.162147  0.654685  0.333264  0.971378

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.to_numpy()

array([[-0.43620182,  0.05707492,  0.45498228, -0.67616066],
       [-1.29135426,  2.23303673, -0.17254253, -0.41807444],
       [-0.44439107,  0.66779035, -0.7137529 ,  1.25280228],
       [-1.28618146,  0.19601021,  0.65158401, -1.08187767],
       [ 0.42445967,  0.46206766,  0.14138869,  0.29819689],
       [ 1.1621465 ,  0.65468487,  0.33326422,  0.97137847]])

In [12]:
df2.to_numpy()

array([[5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'Hi'],
       [5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'Hi'],
       [5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'Hi'],
       [5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'Hi']],
      dtype=object)

In [13]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.436202   -1.291354   -0.444391   -1.286181    0.424460    1.162147
B    0.057075    2.233037    0.667790    0.196010    0.462068    0.654685
C    0.454982   -0.172543   -0.713753    0.651584    0.141389    0.333264
D   -0.676161   -0.418074    1.252802   -1.081878    0.298197    0.971378

In [14]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-01 -0.436202  0.057075  0.454982 -0.676161
2013-01-04 -1.286181  0.196010  0.651584 -1.081878
2013-01-05  0.424460  0.462068  0.141389  0.298197
2013-01-06  1.162147  0.654685  0.333264  0.971378
2013-01-03 -0.444391  0.667790 -0.713753  1.252802
2013-01-02 -1.291354  2.233037 -0.172543 -0.418074

In [15]:
df["A"]

2013-01-01   -0.436202
2013-01-02   -1.291354
2013-01-03   -0.444391
2013-01-04   -1.286181
2013-01-05    0.424460
2013-01-06    1.162147
Freq: D, Name: A, dtype: float64

In [16]:
df[0:1]

                   A         B         C         D
2013-01-01 -0.436202  0.057075  0.454982 -0.676161

In [17]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01 -0.436202  0.057075
2013-01-02 -1.291354  2.233037
2013-01-03 -0.444391  0.667790
2013-01-04 -1.286181  0.196010
2013-01-05  0.424460  0.462068
2013-01-06  1.162147  0.654685

In [18]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [19]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [20]:
df.loc["20130102":"20130103"]
print(df)

                   A         B         C         D
2013-01-01 -0.436202  0.057075  0.454982 -0.676161
2013-01-02 -1.291354  2.233037 -0.172543 -0.418074
2013-01-03 -0.444391  0.667790 -0.713753  1.252802
2013-01-04 -1.286181  0.196010  0.651584 -1.081878
2013-01-05  0.424460  0.462068  0.141389  0.298197
2013-01-06  1.162147  0.654685  0.333264  0.971378

Selection by Location of Label

In [21]:
df.loc[dates[0],"A"]

np.float64(-0.43620181602405905)

In [22]:
df.at[dates[0],"A"]

np.float64(-0.43620181602405905)

Selection by Position || .iloc means selecting by integer based location ,, not by actual index

In [23]:
df.iloc[3]

A   -1.286181
B    0.196010
C    0.651584
D   -1.081878
Name: 2013-01-04 00:00:00, dtype: float64

In [24]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -1.286181  0.196010
2013-01-05  0.424460  0.462068

In [25]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -1.291354 -0.172543
2013-01-03 -0.444391 -0.713753
2013-01-05  0.424460  0.141389

In [26]:
df.iloc[1:3,]

                   A         B         C         D
2013-01-02 -1.291354  2.233037 -0.172543 -0.418074
2013-01-03 -0.444391  0.667790 -0.713753  1.252802

In [27]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.057075  0.454982
2013-01-02  2.233037 -0.172543
2013-01-03  0.667790 -0.713753
2013-01-04  0.196010  0.651584
2013-01-05  0.462068  0.141389
2013-01-06  0.654685  0.333264

In [28]:
df.iloc[1,1]

np.float64(2.2330367269623457)

In [29]:
df

                   A         B         C         D
2013-01-01 -0.436202  0.057075  0.454982 -0.676161
2013-01-02 -1.291354  2.233037 -0.172543 -0.418074
2013-01-03 -0.444391  0.667790 -0.713753  1.252802
2013-01-04 -1.286181  0.196010  0.651584 -1.081878
2013-01-05  0.424460  0.462068  0.141389  0.298197
2013-01-06  1.162147  0.654685  0.333264  0.971378

Boolean Indexing

In [30]:
df[df["A"]>0]

                   A         B         C         D
2013-01-05  0.424460  0.462068  0.141389  0.298197
2013-01-06  1.162147  0.654685  0.333264  0.971378

In [31]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN  0.057075  0.454982       NaN
2013-01-02       NaN  2.233037       NaN       NaN
2013-01-03       NaN  0.667790       NaN  1.252802
2013-01-04       NaN  0.196010  0.651584       NaN
2013-01-05  0.424460  0.462068  0.141389  0.298197
2013-01-06  1.162147  0.654685  0.333264  0.971378

In [32]:
df2 = df.copy()

In [33]:
df2["E"] = ["one","one","two","three","four","three"]

In [34]:
df2

                   A         B         C         D      E
2013-01-01 -0.436202  0.057075  0.454982 -0.676161    one
2013-01-02 -1.291354  2.233037 -0.172543 -0.418074    one
2013-01-03 -0.444391  0.667790 -0.713753  1.252802    two
2013-01-04 -1.286181  0.196010  0.651584 -1.081878  three
2013-01-05  0.424460  0.462068  0.141389  0.298197   four
2013-01-06  1.162147  0.654685  0.333264  0.971378  three

Setting

In [35]:
s1 = pd.Series([1,2,3,4,5,6],index=pd.date_range("20130102",periods=6))

In [36]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [37]:
df["F"]=s1

In [38]:
df.at[dates[0],"A"]=0

In [39]:
df.iat[0,1]=0

df.at(row_label, column_label) is used with labels... df.iat(row_index, column_index) is used with row and column integer index starting from

In [40]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  0.454982 -0.676161  NaN
2013-01-02 -1.291354  2.233037 -0.172543 -0.418074  1.0
2013-01-03 -0.444391  0.667790 -0.713753  1.252802  2.0
2013-01-04 -1.286181  0.196010  0.651584 -1.081878  3.0
2013-01-05  0.424460  0.462068  0.141389  0.298197  4.0
2013-01-06  1.162147  0.654685  0.333264  0.971378  5.0

In [41]:
df.loc[:,"D"]=np.array([5]*len(df))

In [42]:
len(df)

6

In [43]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  0.454982  5.0  NaN
2013-01-02 -1.291354  2.233037 -0.172543  5.0  1.0
2013-01-03 -0.444391  0.667790 -0.713753  5.0  2.0
2013-01-04 -1.286181  0.196010  0.651584  5.0  3.0
2013-01-05  0.424460  0.462068  0.141389  5.0  4.0
2013-01-06  1.162147  0.654685  0.333264  5.0  5.0

In [44]:
df2 = df.copy()

In [45]:
df2[df2>0]= -df2
df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.454982 -5.0  NaN
2013-01-02 -1.291354 -2.233037 -0.172543 -5.0 -1.0
2013-01-03 -0.444391 -0.667790 -0.713753 -5.0 -2.0
2013-01-04 -1.286181 -0.196010 -0.651584 -5.0 -3.0
2013-01-05 -0.424460 -0.462068 -0.141389 -5.0 -4.0
2013-01-06 -1.162147 -0.654685 -0.333264 -5.0 -5.0

Missing Data

In [46]:
df1 = df.reindex(index=dates[0:4], columns =list(df.columns)+["E"])
df1

                   A         B         C    D    F   E
2013-01-01  0.000000  0.000000  0.454982  5.0  NaN NaN
2013-01-02 -1.291354  2.233037 -0.172543  5.0  1.0 NaN
2013-01-03 -0.444391  0.667790 -0.713753  5.0  2.0 NaN
2013-01-04 -1.286181  0.196010  0.651584  5.0  3.0 NaN

In [47]:
df1.loc[dates[0]: dates[1],"E"]=1

In [48]:
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  0.454982  5.0  NaN  1.0
2013-01-02 -1.291354  2.233037 -0.172543  5.0  1.0  1.0
2013-01-03 -0.444391  0.667790 -0.713753  5.0  2.0  NaN
2013-01-04 -1.286181  0.196010  0.651584  5.0  3.0  NaN

Drop Missing Values

In [49]:
df1.dropna(how="any", axis=1)
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  0.454982  5.0  NaN  1.0
2013-01-02 -1.291354  2.233037 -0.172543  5.0  1.0  1.0
2013-01-03 -0.444391  0.667790 -0.713753  5.0  2.0  NaN
2013-01-04 -1.286181  0.196010  0.651584  5.0  3.0  NaN

In [50]:
p=df1.dropna(how="all", axis=1)

In [51]:
p

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  0.454982  5.0  NaN  1.0
2013-01-02 -1.291354  2.233037 -0.172543  5.0  1.0  1.0
2013-01-03 -0.444391  0.667790 -0.713753  5.0  2.0  NaN
2013-01-04 -1.286181  0.196010  0.651584  5.0  3.0  NaN

In [52]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  0.454982  5.0  NaN
2013-01-02 -1.291354  2.233037 -0.172543  5.0  1.0
2013-01-03 -0.444391  0.667790 -0.713753  5.0  2.0
2013-01-04 -1.286181  0.196010  0.651584  5.0  3.0
2013-01-05  0.424460  0.462068  0.141389  5.0  4.0
2013-01-06  1.162147  0.654685  0.333264  5.0  5.0

In [53]:
df3 = df.copy()

In [54]:
df3

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  0.454982  5.0  NaN
2013-01-02 -1.291354  2.233037 -0.172543  5.0  1.0
2013-01-03 -0.444391  0.667790 -0.713753  5.0  2.0
2013-01-04 -1.286181  0.196010  0.651584  5.0  3.0
2013-01-05  0.424460  0.462068  0.141389  5.0  4.0
2013-01-06  1.162147  0.654685  0.333264  5.0  5.0

While using df.dropna function ,,, axis= 0 to remove row , 1 to remove column ... how="any" removes row/column if there is any missing value in the row/column .............. how = "all" removes the row./column only if all the value in the row or column are NaN

In [55]:
df5 = df3.dropna(axis=1, how="any")
df5

                   A         B         C    D
2013-01-01  0.000000  0.000000  0.454982  5.0
2013-01-02 -1.291354  2.233037 -0.172543  5.0
2013-01-03 -0.444391  0.667790 -0.713753  5.0
2013-01-04 -1.286181  0.196010  0.651584  5.0
2013-01-05  0.424460  0.462068  0.141389  5.0
2013-01-06  1.162147  0.654685  0.333264  5.0

Operations

In [56]:
df.rename(columns={"F":"E"},inplace=True)
df

                   A         B         C    D    E
2013-01-01  0.000000  0.000000  0.454982  5.0  NaN
2013-01-02 -1.291354  2.233037 -0.172543  5.0  1.0
2013-01-03 -0.444391  0.667790 -0.713753  5.0  2.0
2013-01-04 -1.286181  0.196010  0.651584  5.0  3.0
2013-01-05  0.424460  0.462068  0.141389  5.0  4.0
2013-01-06  1.162147  0.654685  0.333264  5.0  5.0

In [57]:
df.mean()

A   -0.239220
B    0.702265
C    0.115821
D    5.000000
E    3.000000
dtype: float64

In [58]:
df.mean(axis=0)

A   -0.239220
B    0.702265
C    0.115821
D    5.000000
E    3.000000
dtype: float64

In [59]:
df.mean(axis=1)

2013-01-01    1.363746
2013-01-02    1.353828
2013-01-03    1.301929
2013-01-04    1.512283
2013-01-05    2.005583
2013-01-06    2.430019
Freq: D, dtype: float64

In [60]:
s= pd.Series([1,2,5,np.nan,6,8],index=dates).shift(2)

In [61]:
df,s

(                   A         B         C    D    E
 2013-01-01  0.000000  0.000000  0.454982  5.0  NaN
 2013-01-02 -1.291354  2.233037 -0.172543  5.0  1.0
 2013-01-03 -0.444391  0.667790 -0.713753  5.0  2.0
 2013-01-04 -1.286181  0.196010  0.651584  5.0  3.0
 2013-01-05  0.424460  0.462068  0.141389  5.0  4.0
 2013-01-06  1.162147  0.654685  0.333264  5.0  5.0,
 2013-01-01    NaN
 2013-01-02    NaN
 2013-01-03    1.0
 2013-01-04    2.0
 2013-01-05    5.0
 2013-01-06    NaN
 Freq: D, dtype: float64)

In [62]:
df.sub(s,axis="index")

                   A         B         C    D    E
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -1.444391 -0.332210 -1.713753  4.0  1.0
2013-01-04 -3.286181 -1.803990 -1.348416  3.0  1.0
2013-01-05 -4.575540 -4.537932 -4.858611  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

User Defined Functions

.agg() is used to perform a column wise operation in the dataframe,, where each column as pandas series is operated.. to operate in row, we can use axis=1

In [63]:
df.agg(lambda x: np.mean(x)*2)

A    -0.478440
B     1.404530
C     0.231641
D    10.000000
E     6.000000
dtype: float64

In [64]:
df

                   A         B         C    D    E
2013-01-01  0.000000  0.000000  0.454982  5.0  NaN
2013-01-02 -1.291354  2.233037 -0.172543  5.0  1.0
2013-01-03 -0.444391  0.667790 -0.713753  5.0  2.0
2013-01-04 -1.286181  0.196010  0.651584  5.0  3.0
2013-01-05  0.424460  0.462068  0.141389  5.0  4.0
2013-01-06  1.162147  0.654685  0.333264  5.0  5.0

df.transform() applies a function to each element preserving the shape of the dataframe

In [65]:
df.transform(lambda x:x*100)

                     A           B          C      D      E
2013-01-01    0.000000    0.000000  45.498228  500.0    NaN
2013-01-02 -129.135426  223.303673 -17.254253  500.0  100.0
2013-01-03  -44.439107   66.779035 -71.375290  500.0  200.0
2013-01-04 -128.618146   19.601021  65.158401  500.0  300.0
2013-01-05   42.445967   46.206766  14.138869  500.0  400.0
2013-01-06  116.214650   65.468487  33.326422  500.0  500.0

Value Counts

In [66]:
s = pd.Series(np.random.randint(0,7,size=10))
s

0    1
1    4
2    4
3    6
4    6
5    1
6    5
7    6
8    5
9    2
dtype: int32

In [67]:
s.value_counts()

6    3
1    2
4    2
5    2
2    1
Name: count, dtype: int64

String Methods

In [68]:
s=pd.Series(["A","B","C","Aaba","Baca",np.nan,"CABA","dog","cat"])

In [69]:
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [70]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [71]:
df = pd.DataFrame(np.random.randn(10,4))

In [72]:
df

          0         1         2         3
0  1.047237  0.921152  0.718124  0.208976
1  2.016807 -0.013577  0.045407 -2.529057
2  0.671323 -0.045460 -0.863248  0.210679
3  0.273838 -0.860516  0.408597 -0.620644
4 -1.100337 -1.159654 -0.633025 -0.365790
5  0.313564  0.465001 -0.077767  1.899584
6 -2.092212 -0.028924  0.786966 -0.749485
7  0.759205 -0.366353 -0.988335  0.156431
8 -0.787163  0.174018  0.390778 -1.480768
9 -0.094384  0.022817 -0.125466  0.749667

Breaking into Pieces

In [73]:
pieces = [df[:3],df[3:7],df[7:]]

In [74]:
pieces

[          0         1         2         3
 0  1.047237  0.921152  0.718124  0.208976
 1  2.016807 -0.013577  0.045407 -2.529057
 2  0.671323 -0.045460 -0.863248  0.210679,
           0         1         2         3
 3  0.273838 -0.860516  0.408597 -0.620644
 4 -1.100337 -1.159654 -0.633025 -0.365790
 5  0.313564  0.465001 -0.077767  1.899584
 6 -2.092212 -0.028924  0.786966 -0.749485,
           0         1         2         3
 7  0.759205 -0.366353 -0.988335  0.156431
 8 -0.787163  0.174018  0.390778 -1.480768
 9 -0.094384  0.022817 -0.125466  0.749667]

In [75]:
pd.concat(pieces)

          0         1         2         3
0  1.047237  0.921152  0.718124  0.208976
1  2.016807 -0.013577  0.045407 -2.529057
2  0.671323 -0.045460 -0.863248  0.210679
3  0.273838 -0.860516  0.408597 -0.620644
4 -1.100337 -1.159654 -0.633025 -0.365790
5  0.313564  0.465001 -0.077767  1.899584
6 -2.092212 -0.028924  0.786966 -0.749485
7  0.759205 -0.366353 -0.988335  0.156431
8 -0.787163  0.174018  0.390778 -1.480768
9 -0.094384  0.022817 -0.125466  0.749667

https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#:~:text=records%20to%20it.-,Join,-%23

Join

In [76]:
left = pd.DataFrame({"key":["foo","foo"],"Ival":[1,2]})
left

   key  Ival
0  foo     1
1  foo     2

In [77]:
right = pd.DataFrame({"key":["foo","foo"],"rval":[4,5]})
right

   key  rval
0  foo     4
1  foo     5

In [78]:
pd.merge(left,right,on="key")

   key  Ival  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [79]:
left = pd.DataFrame({"key":["foo","zoo"],"Ival":[1,2]})
right = pd.DataFrame({"key":["foo","zoo"],"Jval":[4,5]})
pd.merge(left,right,on="key")

   key  Ival  Jval
0  foo     1     4
1  zoo     2     5

Grouping

In [80]:
df = pd.DataFrame(
    {
        "A":["foo","bar","foo","bar","foo","bar","foo","bar"],
        "B":["one","one","two","three","two","two","one","one"],
        "C":np.random.randn(8),
        "D":np.random.randn(8)
    }
)

In [81]:
df

     A      B         C         D
0  foo    one -1.623333  0.356701
1  bar    one  0.261967  1.704325
2  foo    two  0.449458 -0.019599
3  bar  three  1.018087 -2.046522
4  foo    two  0.259680  1.145980
5  bar    two  0.051295 -0.439931
6  foo    one -0.622184  0.423923
7  bar    one  0.154457  0.356500

[2082/05/07 09:55 PM](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#:~:text=a%20column%20label%2C%20selecting)

In [82]:
df.groupby("A")[["C","D"]].sum()

            C         D
A
bar  1.485806 -0.425628
foo -1.536378  1.907005

2081/05/08    08:09 PM ...... August 24, 2025

In [83]:
df.groupby("A")[["C"]].sum()

            C
A
bar  1.485806
foo -1.536378

In [84]:
df.groupby("B").sum()

                  A         C         D
B
one    foobarfoobar -1.829092  2.841449
three           bar  1.018087 -2.046522
two       foofoobar  0.760433  0.686451

2082/05/13  08:10 PM, @ Tinkune

In [85]:
df

     A      B         C         D
0  foo    one -1.623333  0.356701
1  bar    one  0.261967  1.704325
2  foo    two  0.449458 -0.019599
3  bar  three  1.018087 -2.046522
4  foo    two  0.259680  1.145980
5  bar    two  0.051295 -0.439931
6  foo    one -0.622184  0.423923
7  bar    one  0.154457  0.356500

In [86]:
df.groupby(["A"]).sum()

                  B         C         D
A
bar  onethreetwoone  1.485806 -0.425628
foo    onetwotwoone -1.536378  1.907005

Reshaping

In [87]:
arrays = [["bar","bar","baz","baz","foo","foo","qux","qux"],
["one","two","one","two","one","two","one","two"]]

In [88]:
index = pd.MultiIndex.from_arrays(arrays, names=["first","second"])
df = pd.DataFrame(np.random.randn(8,2), index=index, columns=["A","B"])

In [89]:
df

                     A         B
first second
bar   one    -0.787127 -1.252087
      two     0.754029  0.411151
baz   one     0.001703  0.664992
      two     0.065173  0.776233
foo   one     0.024752  1.096005
      two     0.440781 -1.161908
qux   one     1.743340 -0.650436
      two    -1.285502 -0.375975

In [90]:
df2 = df[:4]
df2

                     A         B
first second
bar   one    -0.787127 -1.252087
      two     0.754029  0.411151
baz   one     0.001703  0.664992
      two     0.065173  0.776233

In pandas, df.stack() is used to pivot (or stack) the columns of a DataFrame into the row index, essentially reshaping the data from a wide format to a long format.

In [91]:
stacked = df2.stack(future_stack = True)
stacked

first  second
bar    one     A   -0.787127
               B   -1.252087
       two     A    0.754029
               B    0.411151
baz    one     A    0.001703
               B    0.664992
       two     A    0.065173
               B    0.776233
dtype: float64

[Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#:~:text=B%20%2D0.693205%20%201.591431-,Pivot%20tables,-%23)

In [92]:
df = pd.DataFrame(
    {
        "A":["one","one","two","three"] * 3,
        "B":["A","B","C"]*4,
        "C":["foo","foo","foo","bar","bar","bar"]*2,
        "D":np.random.randn(12),
        "E": np.random.randn(12),
    }
)

In [93]:
df

        A  B    C         D         E
0     one  A  foo  0.196886  1.042941
1     one  B  foo  0.177335  0.355671
2     two  C  foo -0.998191 -0.584043
3   three  A  bar -0.076502  1.072990
4     one  B  bar -0.593021  0.639007
5     one  C  bar  0.241921  0.198636
6     two  A  foo  0.595890  0.542993
7   three  B  foo -1.396214  2.326620
8     one  C  foo -0.147455 -1.077846
9     one  A  bar -0.294257  0.241551
10    two  B  bar  0.871164 -0.236261
11  three  C  bar  1.392234  0.503481

In [94]:
pd.pivot_table(df, values="D",index=["A","B"],columns=["C"])

C             bar       foo
A     B
one   A -0.294257  0.196886
      B -0.593021  0.177335
      C  0.241921 -0.147455
three A -0.076502       NaN
      B       NaN -1.396214
      C  1.392234       NaN
two   A       NaN  0.595890
      B  0.871164       NaN
      C       NaN -0.998191

2082/05/21  06:40 PM    ,,,, @Home, Lalitpur

In [95]:
pd.pivot_table(df, values="D", index = ["A","B"], columns = ["C"])

C             bar       foo
A     B
one   A -0.294257  0.196886
      B -0.593021  0.177335
      C  0.241921 -0.147455
three A -0.076502       NaN
      B       NaN -1.396214
      C  1.392234       NaN
two   A       NaN  0.595890
      B  0.871164       NaN
      C       NaN -0.998191

Time Series

pandas has simple, powerful, and efficient functionality for performing resampling operations during frequency conversion (e.g., converting secondly data into 5-minutely data). This is extremely common in, but not limited to, financial applications. See the

In [98]:
rng = pd.date_range("1/1/2012", periods = 100 , freq = "s")
ts = pd.Series(np.random.randint(0,500, len(rng)), index=rng)
ts.resample("1Min").sum()

2012-01-01 00:00:00    14950
2012-01-01 00:01:00    11120
Freq: min, dtype: int32

In [97]:
rng

DatetimeIndex(['2012-01-01 00:00:00', '2012-01-01 00:00:01',
               '2012-01-01 00:00:02', '2012-01-01 00:00:03',
               '2012-01-01 00:00:04', '2012-01-01 00:00:05',
               '2012-01-01 00:00:06', '2012-01-01 00:00:07',
               '2012-01-01 00:00:08', '2012-01-01 00:00:09',
               '2012-01-01 00:00:10', '2012-01-01 00:00:11',
               '2012-01-01 00:00:12', '2012-01-01 00:00:13',
               '2012-01-01 00:00:14', '2012-01-01 00:00:15',
               '2012-01-01 00:00:16', '2012-01-01 00:00:17',
               '2012-01-01 00:00:18', '2012-01-01 00:00:19',
               '2012-01-01 00:00:20', '2012-01-01 00:00:21',
               '2012-01-01 00:00:22', '2012-01-01 00:00:23',
               '2012-01-01 00:00:24', '2012-01-01 00:00:25',
               '2012-01-01 00:00:26', '2012-01-01 00:00:27',
               '2012-01-01 00:00:28', '2012-01-01 00:00:29',
               '2012-01-01 00:00:30', '2012-01-01 00:00:31',
               '2012-01-01 00:00:32', '2012-01-01 00:00:33',
               '2012-01-01 00:00:34', '2012-01-01 00:00:35',
               '2012-01-01 00:00:36', '2012-01-01 00:00:37',
               '2012-01-01 00:00:38', '2012-01-01 00:00:39',
               '2012-01-01 00:00:40', '2012-01-01 00:00:41',
               '2012-01-01 00:00:42', '2012-01-01 00:00:43',
               '2012-01-01 00:00:44', '2012-01-01 00:00:45',
               '2012-01-01 00:00:46', '2012-01-01 00:00:47',
               '2012-01-01 00:00:48', '2012-01-01 00:00:49',
               '2012-01-01 00:00:50', '2012-01-01 00:00:51',
               '2012-01-01 00:00:52', '2012-01-01 00:00:53',
               '2012-01-01 00:00:54', '2012-01-01 00:00:55',
               '2012-01-01 00:00:56', '2012-01-01 00:00:57',
               '2012-01-01 00:00:58', '2012-01-01 00:00:59',
               '2012-01-01 00:01:00', '2012-01-01 00:01:01',
               '2012-01-01 00:01:02', '2012-01-01 00:01:03',
               '2012-01-01 00:01:04', '2012-01-01 00:01:05',
               '2012-01-01 00:01:06', '2012-01-01 00:01:07',
               '2012-01-01 00:01:08', '2012-01-01 00:01:09',
               '2012-01-01 00:01:10', '2012-01-01 00:01:11',
               '2012-01-01 00:01:12', '2012-01-01 00:01:13',
               '2012-01-01 00:01:14', '2012-01-01 00:01:15',
               '2012-01-01 00:01:16', '2012-01-01 00:01:17',
               '2012-01-01 00:01:18', '2012-01-01 00:01:19',
               '2012-01-01 00:01:20', '2012-01-01 00:01:21',
               '2012-01-01 00:01:22', '2012-01-01 00:01:23',
               '2012-01-01 00:01:24', '2012-01-01 00:01:25',
               '2012-01-01 00:01:26', '2012-01-01 00:01:27',
               '2012-01-01 00:01:28', '2012-01-01 00:01:29',
               '2012-01-01 00:01:30', '2012-01-01 00:01:31',
               '2012-01-01 00:01:32', '2012-01-01 00:01:33',
               '2012-01-01 00:01:34', '2012-01-01 00:01:35',
               '2012-01-01 00:01:36', '2012-01-01 00:01:37',
               '2012-01-01 00:01:38', '2012-01-01 00:01:39'],
              dtype='datetime64[ns]', freq='s')

In [99]:
rng = pd.date_range("3/6/2012", periods=5, freq="D")
ts = pd.Series(np.random.randn(len(rng)), rng)

ts

2012-03-06    0.272909
2012-03-07   -1.364675
2012-03-08    0.767468
2012-03-09   -0.248700
2012-03-10   -1.029917
Freq: D, dtype: float64

In [101]:
ts_utc = ts.tz_localize("UTC")
ts_utc

2012-03-06 00:00:00+00:00    0.272909
2012-03-07 00:00:00+00:00   -1.364675
2012-03-08 00:00:00+00:00    0.767468
2012-03-09 00:00:00+00:00   -0.248700
2012-03-10 00:00:00+00:00   -1.029917
Freq: D, dtype: float64

In [102]:
ts_utc.tz_convert("US/Eastern")

2012-03-05 19:00:00-05:00    0.272909
2012-03-06 19:00:00-05:00   -1.364675
2012-03-07 19:00:00-05:00    0.767468
2012-03-08 19:00:00-05:00   -0.248700
2012-03-09 19:00:00-05:00   -1.029917
Freq: D, dtype: float64

In [103]:
rng

DatetimeIndex(['2012-03-06', '2012-03-07', '2012-03-08', '2012-03-09',
               '2012-03-10'],
              dtype='datetime64[ns]', freq='D')

In [104]:
rng + pd.offsets.BusinessDay(5)

DatetimeIndex(['2012-03-13', '2012-03-14', '2012-03-15', '2012-03-16',
               '2012-03-16'],
              dtype='datetime64[ns]', freq=None)